Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/svd/PIC32CX2051MTC128S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>04670E</version>
         <description>Supply Controller</description>
         <baseAddress>0x400531D0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SUPC</name>
            <value>0</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP3</name>
            <value>62</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP4</name>
            <value>63</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP5</name>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP6</name>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP7</name>
            <value>66</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP8</name>
            <value>67</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP9</name>
            <value>68</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP10</name>
            <value>69</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP11</name>
            <value>70</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP12</name>
            <value>71</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP13</name>
            <value>72</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP14</name>
            <value>73</value>
         </interrupt>
         <interrupt>
            <name>SUPC_WKUP15</name>
            <value>74</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SHDW</name>
                     <description>Shutdown</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHDWEOF</name>
                     <description>Shutdown End Of Frame</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VROFF</name>
                     <description>Voltage Regulator Off</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VROFFSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP_VREG</name>
                           <description>If KEY=0xA5, VROFF asserts the VDDCORE domain reset and stops the voltage regulator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDXTALSEL</name>
                     <description>Timing Domain Slow Clock Selector</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDXTALSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>Slow clock of the timing domain is driven by the embedded 32 kHz (typical) RC oscillator.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTAL</name>
                           <description>Slow clock of the timing domain is driven by the 32.768 kHz crystal oscillator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMMR</name>
               <description>Supply Monitor Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VDD3V3SMTH</name>
                     <description>VDD3V3 Supply Monitor Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMSMPL</name>
                     <description>VDD3V3 Supply Monitor Sampling Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>VDD3V3SMSMPLSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>VDD3V3 supply monitor is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALWAYS_ON</name>
                           <description>Continuous VDD3V3 supply monitoring</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32SLCK</name>
                           <description>VDD3V3 supply monitor is enabled for 1 period every 32 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256SLCK</name>
                           <description>VDD3V3 supply monitor is enabled for 1 period every 256 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048SLCK</name>
                           <description>VDD3V3 supply monitor is enabled for 1 period every 2048 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VDD3V3SMRSTEN</name>
                     <description>VDD3V3 Supply Monitor Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMPWRM</name>
                     <description>VDD3V3 Supply Monitor Power Supply Mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VDD3V3SMPWRMSelect</name>
                        <enumeratedValue>
                           <name>MANUAL</name>
                           <description>The VDDBU power source selection is controlled by configuring the bit RSTC_MR.PWRSW.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_VDD3V3SM</name>
                           <description>The VDDBU power source is VBAT when a VDD3V3 undervoltage is detected by the VDD3V3 supply monitor.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LCDOUT</name>
                     <description>LCD Voltage Regulator Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LCDMODE</name>
                     <description>LCD Controller Mode of Operation</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>LCDMODESelect</name>
                        <enumeratedValue>
                           <name>LCDOFF</name>
                           <description>The internal supply source and the external supply source are both deselected (OFF Mode).</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LCDON_EXTVR</name>
                           <description>The external supply source for LCD (VDDLCD) is selected (the embedded LCD voltage regulator is in High-impedance mode).</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LCDON_INVR</name>
                           <description>The internal voltage regulator for VDDLCD is selected (Active mode).</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORSMM</name>
                     <description>VDDCORE Supply Monitor Output Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORSMMSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>VDDCORE supply monitor output value has no effect. Power-on is performed whatever the value of the supply monitor output.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALID_VDD</name>
                           <description>VDDCORE supply monitor output value is checked to validate the VDDCORE domain power-on.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREGDIS</name>
                     <description>Internal VDDCORE Voltage Regulator Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VREGDISSelect</name>
                        <enumeratedValue>
                           <name>INT_VREG</name>
                           <description>Internal VDDCORE voltage regulator is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_VREG</name>
                           <description>Internal VDDCORE voltage regulator is disabled (external power supply is used).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORSMRSTEN</name>
                     <description>VDDCORE Supply Monitor Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CORSMDIS</name>
                     <description>VDDCORE Supply Monitor Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IO_BACKUP_ISO</name>
                     <description>Backup Domain IO Isolation Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCBYPASS</name>
                     <description>Slow Crystal Oscillator Bypass</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCBYPASSSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect. Clock selection depends on the value of the bit SUPC_CR.TDXTALSEL.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>The slow crystal oscillator is bypassed if SUPC_CR.TDXTALSEL=1. The bit OSCBYPASS must be set prior to setting the bit TDXTALSEL.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD1</name>
                           <description>Modifies the VREGDIS bit. Other bits are not affected.</description>
                           <value>0x59</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
